samples/business-process-samples/product/src/main/resources/bpel/2.0/RepeatUntil/RepeatUntilArtifacts.wsdl

<?xml version="1.0"?>
<definitions name="RepeatUntil"
        targetNamespace="http://wso2.org/bps/samples/RepeatUntil"
        xmlns:tns="http://wso2.org/bps/samples/RepeatUntil"
        xmlns:plnk="http://docs.oasis-open.org/wsbpel/2.0/plnktype"
        xmlns="http://schemas.xmlsoap.org/wsdl/"
        xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">

<!-- ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     TYPE DEFINITION - List of types participating in this BPEL process 
     The BPEL Designer will generate default request and response types
     but you can define or import any XML Schema type and use them as part 
     of the message types.
     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ -->    
    <types>
        <schema attributeFormDefault="unqualified" elementFormDefault="qualified" 
                targetNamespace="http://wso2.org/bps/samples/RepeatUntil" 
                xmlns="http://www.w3.org/2001/XMLSchema">

            <element name="RepeatUntilRequest">
                <complexType>
                    <sequence>
                        <element name="input" type="string"/>
                    </sequence>
                </complexType>
            </element>

            <element name="RepeatUntilResponse">
                <complexType>
                    <sequence>
                        <element name="result" type="string"/>
                    </sequence>
                </complexType>
            </element>
        </schema>
    </types>


<!-- ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     MESSAGE TYPE DEFINITION - Definition of the message types used as 
     part of the port type defintions
     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ -->    
    <message name="RepeatUntilRequestMessage">
        <part name="payload" element="tns:RepeatUntilRequest"/>
    </message>
    <message name="RepeatUntilResponseMessage">
        <part name="payload" element="tns:RepeatUntilResponse"/>
    </message>

<!-- ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     PORT TYPE DEFINITION - A port type groups a set of operations into
     a logical service unit.
     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ -->    

    <!-- portType implemented by the RepeatUntil BPEL process -->
    <portType name="RepeatUntil">
        <operation name="process">
            <input  message="tns:RepeatUntilRequestMessage" />
            <output message="tns:RepeatUntilResponseMessage"/>
        </operation>
    </portType>
  

<!-- ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~
     PARTNER LINK TYPE DEFINITION
     ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ -->    
    <plnk:partnerLinkType name="RepeatUntil">
        <plnk:role name="RepeatUntilProvider" portType="tns:RepeatUntil"/>
    </plnk:partnerLinkType>
    
    <binding name="SOAPBinding" type="tns:RepeatUntil">
    	<soap:binding style="document"
    		transport="http://schemas.xmlsoap.org/soap/http" />
    	<operation name="process">
    		<soap:operation
    			soapAction="http://wso2.org/bps/samples/RepeatUntil/process" />
    		<input>
    			<soap:body use="literal" />
    		</input>
    		<output>
    			<soap:body use="literal" />
    		</output>
    	</operation>
    </binding>
    <service name="RepeatUntilService">
    	<port name="RepeatUntilServicePort" binding="tns:SOAPBinding">
    		<soap:address location="http://www.example.org/" />
    	</port>
    </service>
</definitions>
