samples/business-process-samples/product/src/main/resources/bpel/2.0/RepeatUntil/test.properties

#
#    Licensed to the Apache Software Foundation (ASF) under one or more
#    contributor license agreements.  See the NOTICE file distributed with
#    this work for additional information regarding copyright ownership.
#    The ASF licenses this file to You under the Apache License, Version 2.0
#    (the "License"); you may not use this file except in compliance with
#    the License.  You may obtain a copy of the License at
#
#       http://www.apache.org/licenses/LICENSE-2.0
#
#    Unless required by applicable law or agreed to in writing, software
#    distributed under the License is distributed on an "AS IS" BASIS,
#    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
#    See the License for the specific language governing permissions and
#    limitations under the License.
#

namespace=http://wso2.org/bps/samples/RepeatUntil
service=RepeatUntilService
operation=process
request1=<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tes="http://wso2.org/bps/samples/RepeatUntil">
   <soapenv:Header/>
   <soapenv:Body>
      <tes:RepeatUntilRequest>
         <tes:input>7</tes:input>
      </tes:RepeatUntilRequest>
   </soapenv:Body>
</soapenv:Envelope>

response1=<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Body>
      <RepeatUntilResponse xmlns="http://wso2.org/bps/samples/RepeatUntil">
         <tns:result xmlns:tns="http://wso2.org/bps/samples/RepeatUntil">17.0</tns:result>
      </RepeatUntilResponse>
   </soapenv:Body>
</soapenv:Envelope>
